# How work Concat:-

In [5]:
import pandas as pd

In [20]:
d1 = pd.DataFrame({"sr1":[1,2,3,4],"sr2":[5,6,7,8]})
d2 = pd.DataFrame({"sr1":[1,2,3,24],"sr3":[9,10,11,12]})

In [7]:
var1 = pd.concat([d1,d2])

In [8]:
var1

   sr1  sr2   sr3
0    1  5.0   NaN
1    2  6.0   NaN
2    3  7.0   NaN
3    4  8.0   NaN
0    1  NaN   9.0
1    2  NaN  10.0
2    3  NaN  11.0
3   24  NaN  12.0

In [9]:
var2 = pd.concat([d1,d2],axis=0)

In [10]:
var2

   sr1  sr2   sr3
0    1  5.0   NaN
1    2  6.0   NaN
2    3  7.0   NaN
3    4  8.0   NaN
0    1  NaN   9.0
1    2  NaN  10.0
2    3  NaN  11.0
3   24  NaN  12.0

In [11]:
var3 = pd.concat([d1,d2],axis=1)

In [12]:
var3

   sr1  sr2  sr1  sr3
0    1    5    1    9
1    2    6    2   10
2    3    7    3   11
3    4    8   24   12

In [14]:
var4 = pd.concat([d1,d2],axis=1,join="inner")

In [15]:
var4

   sr1  sr2  sr1  sr3
0    1    5    1    9
1    2    6    2   10
2    3    7    3   11
3    4    8   24   12

In [17]:
var5 = pd.concat([d1,d2],axis=1,join="outer")

In [18]:
var5

   sr1  sr2  sr1  sr3
0    1    5    1    9
1    2    6    2   10
2    3    7    3   11
3    4    8   24   12

In [25]:
d3 = pd.DataFrame({"sr1":[1,2,3,4],"sr2":[5,6,7,8]})
d4 = pd.DataFrame({"sr1":[1,2],"sr3":[9,10]})

In [26]:
var5 = pd.concat([d3,d4],axis=1,join="outer")

In [27]:
var5

   sr1  sr2  sr1   sr3
0    1    5  1.0   9.0
1    2    6  2.0  10.0
2    3    7  NaN   NaN
3    4    8  NaN   NaN

# when you want make data key use this method:-

In [28]:
var6 = pd.concat([d1,d2],axis=1,keys=["d1","d2"])

In [29]:
var6

   d1      d2
  sr1 sr2 sr1 sr3
0   1   5   1   9
1   2   6   2  10
2   3   7   3  11
3   4   8  24  12